## Plan Result (Sandbox - TerraformPlanApply)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.sandbox-apps-hmcts.azurerm_dns_cname_record.this[&#34;darts.sandbox&#34;]
  * module.sandbox-apps-hmcts.azurerm_dns_cname_record.this[&#34;juror-public.sandbox&#34;]
  * module.sandbox-apps-hmcts.azurerm_dns_cname_record.this[&#34;juror.sandbox&#34;]
  * module.sandbox-apps-hmcts.azurerm_dns_zone.zone
  * module.sandbox-apps-hmcts.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sandbox-apps-hmcts.azurerm_dns_cname_record.this["darts.sandbox"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts.sandbox"
      + record              = "sdshmcts-sbox-bueqa6a6hefjfne4.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.apps.hmcts.net"
    }

  # module.sandbox-apps-hmcts.azurerm_dns_cname_record.this["juror-public.sandbox"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-public.sandbox"
      + record              = "sdshmcts-sbox-bueqa6a6hefjfne4.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.apps.hmcts.net"
    }

  # module.sandbox-apps-hmcts.azurerm_dns_cname_record.this["juror.sandbox"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror.sandbox"
      + record              = "sdshmcts-sbox-bueqa6a6hefjfne4.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.apps.hmcts.net"
    }

  # module.sandbox-apps-hmcts.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "sandbox.apps.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record (known after apply)
    }

  # module.sandbox-apps-hmcts.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c2d130e-ba66-408a-bdf9-f426a9730923"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1870,"Program":"tfcmt","SHA1":"","Target":"Sandbox - TerraformPlanApply","Vars":{}} -->